Grid_Independence/straightDiamond_25879/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontandback
    {
        type            empty;
        inGroups        List<word> 1(wall);
        nFaces          51758;
        startFace       51391;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       103149;
    }
    diamond
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       103549;
    }
    inlet
    {
        type            patch;
        nFaces          134;
        startFace       103599;
    }
    outlet
    {
        type            patch;
        nFaces          134;
        startFace       103733;
    }
)

// ************************************************************************* //
